app/Modules/Auth/Log/Models/LogModel.php

	public function saveLog($par=[]) {
		$user_id = session()->get('user_id') ?? $par['user_id'];

		if ($this->store_in == 'database') { # jika disimpan di database
            $data = [
                'user_id' => $user_id,
                'reflog_id' => $par['reflog_id'],
                'keterangan' =>  $par['keterangan']
			];
			# $returnID = false, agar nilai kembalian bukan user_id tapi result boolean
			return $this->insert($data, false); # (data, returnID)
---
INSERT INTO `user_log` (`user_id`, `reflog_id`, `keterangan`, `created_at`, `updated_at`) VALUES ('1', 1, 'Login sebagai admin dengan Edge 132.0.0.0 (Windows 10) IP. 172.18.0.1', '2025-01-25 15:21:05', '2025-01-25 15:21:05')