app/Modules/Master/Kendaraan/Controllers/Kendaraan.php

SELECT *
FROM `kelompok`
WHERE `keterangan` = 'kendaraan rutin'
 LIMIT 1
---
	public function getDatatable() {
		# kelompok kendaraan diambil dari url
		$segment = getSegment();
		$kelompok_id = $this->KelompokModel->where('keterangan', str_replace('-', ' ', $segment[2]))->first()['id'];