app/Modules/Auth/Login/Models/LoginModel.php

SELECT a.id as user_id, a.user_name, a.password, a.nama_lengkap, a.level_id, b.keterangan AS level_ket,
                          a.unit_id, c.nm_unit, a.is_active, a.is_login
FROM `user` `a`
INNER JOIN `user_level` `b` ON `a`.`level_id` = `b`.`id`
LEFT JOIN `unit` `c` ON `a`.`unit_id` = `c`.`id`
WHERE `a`.`user_name` = 'admin'
---
    public function doLogin($par) {
        $builder = $this->builder('user a');
        $builder->select("a.id as user_id, a.user_name, a.password, a.nama_lengkap, a.level_id, b.keterangan AS level_ket,
                          a.unit_id, c.nm_unit, a.is_active, a.is_login", false)
                ->join('user_level b', 'a.level_id = b.id', 'inner')
                ->join('unit c', 'a.unit_id = c.id', 'left');

        switch (key($par)) {
            case 'user_name': # login by username
                $builder->where('a.user_name', $par['user_name']);
                break;
        }

        return $builder->get()->getFirstRow('array');