app/Modules/Auth/User/Controllers/User.php

	public function getForm() {
		$get = [];
		foreach($_GET as $k => $v) $get[$k] = $this->request->getGet($k);
		$data['mod'] = 'user';
		$data['sts'] = $get['sts'];

	    if ($get['sts'] == 'edit' || $get['sts'] == 'view') {
			$data['data'] = $this->UserModel->getDetail($get['id']);
			//$data['for_select'] = (new XModel)->getFn($par);
		}

		$data['level'] = $this->LevelModel->get()->getResultArray();
		$data['unit'] = $this->UnitModel->get()->getResultArray();
---
SELECT *
FROM `user_level`
SELECT *
FROM `unit`