app/Modules/Monitoring/MonitoringKendaraan/Controllers/MonitoringKendaraan.php

	public function getDatatable() {
		# kelompok kendaraan diambil dari url
		$segment = getSegment();
		$kelompok_id = $this->KelompokModel->where('keterangan', str_replace('monitoring ', '', str_replace('-', ' ', $segment[1])))->first()['id'];
---
SELECT *
FROM `kelompok`
WHERE `keterangan` = 'kendaraan rutin'
 LIMIT 1