app/Modules/Auth/User/Models/UserModel.php

	public function getDetail($id) {
		return $this->where('id', $id)->first();
---
SELECT *
FROM `user`
WHERE `id` = '1'
 LIMIT 1

	public function setLogin($id, $status) {
		$data['is_login'] = $status;

		if ($status == 'T') {
			$data['last_login'] = date('Y-m-d H:i:s');
		}

		return $this->update($id, $data);
---
UPDATE `user` SET `is_login` = 'T', `last_login` = '2025-01-25 15:21:05', `updated_at` = '2025-01-25 15:21:05'
WHERE `user`.`id` IN ('1')